Revit 2027 API
RailingType.TopRailHeight Property
 The height of the top rail in the railing system.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TopRailHeight { get; set; }
Public Property TopRailHeight As Double
	Get
	Set
public:
property double TopRailHeight {
	double get ();
	void set (double value);
}
member TopRailHeight : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for height must be between 0 and 30000 feet.
See Also
Reference
RailingType Class
Autodesk.Revit.DB.Architecture Namespace